Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/M11A.tmx
Source language: en_us
Languages: zh_cn

source: Dear Sunshine
zh_cn: 亲亲阳光

source: When he was born he had exactly six minutes of normal living.
zh_cn: 他刚出生时，有过正好六分钟的正常生活。

source: For those six minutes he was loved, cosseted and crooned over by midwives and nurses.
zh_cn: 在这六分钟里，助产士和护士们喜爱他，宠爱他，轻哼着歌哄他。

source: He entered the world feeling cautious but very comfortable.
zh_cn: 他来到这个世界，虽然小心翼翼，但是感觉很舒服。

source: Then he opened his eyes.
zh_cn: 然后他睁开了眼睛。

source: A few of the nurses shrieked; some ran away.
zh_cn: 几个护士恐怖地尖叫起来，一些甚至逃走了。

source: "What is it?" his mother demanded.
zh_cn: “怎么了？”他母亲问道。

source: "This one has a dragon behind his eyes," the head midwife said, her voice matter-of-fact and precise.
zh_cn: “这个孩子眼睛里有一只龙”，主助产士说到，声音不容置疑又极其精确。

source: She had been delivering babies for far too long to panic at every little abnormality that might occur during a birth.
zh_cn: 她做接生婴儿的工作太久了，久到对于任何一次生产中可能发生的怪异事也已经司空见惯，毫不惊慌了。

source: "Best set him out to die now before you get too attached.
zh_cn: “在你感到不舍之前，最好把他扔掉，让他死了。”

source: They were just words then- meaningless sounds.
zh_cn: 对他而言都是些词罢了--没有意义的声音。

source: He didn't cry out because they meant nothing; instead, he sensed the midwife's calm manner, her professional handling of his small body, her scent of sweat and stale lavender.
zh_cn: 他没有因为它们什么意义都没有而哭；相反的，他察觉到了助产士的平静，她握着他小小身体的专业，以及她身上汗水混合着变淡薰衣草香水的味道。

source: He liked all of these things, and nestled close to her body.
zh_cn: 他喜欢这一切，舒适地紧靠着她的身体。

source: "Yes," the midwife added, "kill him before you even give him a name.
zh_cn: “对，”助产士继续说：“在你给他起名字前，杀了他。

source: It's better that way."
zh_cn: 这样最好。”

source: "He has a name," his mother snapped, taking him from the midwife's arms with jarring force.
zh_cn: “他有名字了，”她母亲厉声说，用惊人的力量把他从助产士的手臂中抢了过来。

source: "His name is Dear Sunshine."
zh_cn: “他的名字叫亲亲阳光。”

source: His mother wrapped a blindfold around his eyes and from then on he lived in darkness.
zh_cn: 他母亲给他的眼镜围上了眼罩，从此，他生活在黑暗中。

source: "You can't turn a monster into a boy," his father said, "And you can't turn a dragon into a son."
zh_cn: “你根本不能把怪物变成小男孩”他父亲说：“你也不可能把龙变成自己的儿子。”

source: "Just watch what I can do," his mother said.
zh_cn: “等着瞧吧，看我能做到什么”他母亲说。

source: By then, three days after his birth, he was already starting to understand human language.
zh_cn: 那时，他已经出生三天了，已经开始懂得人类的语言了。

source: But he was small and frail and couldn't move around like he wanted.
zh_cn: 但是他太小太弱了，根本不能如他所愿地移动。

source: He hated how useless he was.
zh_cn: 他讨厌自己的无能。

source: He cried all the time to express his outrage.
zh_cn: 不停地哭泣以表达他的愤怒。

source: He killed his first man when he was three.
zh_cn: 他三岁时第一次杀人。

source: A drunken knight snatched off the boy's blindfold as a dare.
zh_cn: 作为一个挑战，一个醉醺醺的骑士抢走了男孩儿的眼罩。

source: The knight wanted to see a dragon and so a dragon was the last thing he ever saw.
zh_cn: 骑士想看看龙，结果龙成了他看到的最后的东西。

source: No one but the boy's mother dared approach him to put his blindfold back on; they were afraid that they too would have their heads smashed against the walls.
zh_cn: 除了男孩儿的母亲，没人敢靠近他，把他的眼罩戴回去；他们害怕他们的头也会被砸在墙上砸个粉碎。

source: "Dear Sunshine," his mother said, crossing her arms.
zh_cn: “亲亲阳光”他母亲把双臂交叉在胸前。

source: It was the first time he ever got a good look at his mother- she was thin and fierce, like a dragon.
zh_cn: 那是他第一次认真地审视自己的妈妈----她又瘦又强悍，像一只龙一样。

source: Ugly but aesthetically pleasing. He admired the sight of her.
zh_cn: 虽然很丑但是审美上让人很愉悦。

source: "What have I said about killing people?"
zh_cn: “关于杀人的事，我是怎么说的？”

source: "Not to," he said, a tad sulky.
zh_cn: “不要杀人，”他说，有点小孩子气。

source: "And why did you?"
zh_cn: “那你刚才为什么杀人？”

source: Because the dragon wanted me to, he could have answered.
zh_cn: 因为龙想让我杀人，他本来可以这么回答。

source: Because the knight was stupid and deserved it and because all day, every day, the dragon screams under my skin Release me Release me Release me Release me and so I released him and it felt good.
zh_cn: 因为那个骑士太蠢了，活该被杀，因为那只龙每天都整天在我的身体里吼着，重复喊着---- 放了我，放了我，放了我，放了我，所以我放了他，感觉很好。

source: "I forgot," he said instead.
zh_cn: “我忘了，”代替地，他这样答道。

source: She looked at him with disbelief.
zh_cn: 她不可置信地望着他。

source: "Don't kill and don't lie.
zh_cn: “不准杀人，不准撒谎。

source: You know better."
zh_cn: 你心里有数。”

source: Her stern face was the last thing he saw before she looped the blindfold around his eyes once more.
zh_cn: 他最后看到的是她严峻的脸，之后她再一次把眼罩蒙上了他的眼睛。

source: The year he turned ten, his parents fought constantly and without surrender.
zh_cn: 这一年他十岁了，父母不停地打架，谁也不服输。

source: "You think I don't know about your whores?" his mother screamed.
zh_cn: “你以为我不知道你嫖妓？”他母亲尖叫。

source: "You think I don't know about all your bastards?"
zh_cn: “你以为我不知道你还有私生子？”

source: "You think I'll risk breeding a bitch who throws out dragons?" his father snarled. "You think I want that thing to be my heir?"
zh_cn: “你以为我会犯傻养活个会生龙的婊子？”他父亲咆哮道：“你以为我想要那东西当我的继承人？”

source: "Well he is your heir and you just have to deal with that."
zh_cn: “哼，他就是你的继承人，你还就得面对这种事。”

source: That night, all the king's bastards had their throats slit, one by one.
zh_cn: 那天晚上，所有的国王的混蛋们都从他们嘴里溜了出来，一个接着一个。

source: Everyone blamed Dear Sunshine.
zh_cn: 所有都是亲亲阳光的错。

source: His father struck him once in the head but never again after the boy nearly tore out his arm.
zh_cn: 他父亲打了他脑袋一次，但是在男孩儿差点把他胳膊扯下来之后，他再也没那么干过。

source: When he was twelve, the assassination attempts started.
zh_cn: 他十二岁时，暗杀事件开始了。

source: They amused him more than anything else- as if poison or blades or fire could ever be enough to kill a dragon!
zh_cn: 比起其他事，他们都最爱以他取乐----似乎毒药，刀或者火就足够杀死一只龙了！

source: The only result was a lot of dead assassins.
zh_cn: 唯一的结果就是多了许多的刺客。

source: But his mother grew unhappy at each attempt on his life.
zh_cn: 但是他母亲对有人想取他性命的事变得越来越不高兴。

source: She said nothing, did nothing, but Dear Sunshine knew her well.
zh_cn: 她什么也不说，什么也不做，但是亲爱的阳光太了解她了。

source: So did the dragon.
zh_cn: 那只龙也是。

source: The barbarians came when he was fifteen.
zh_cn: 他十五岁时，野蛮人出现了。

source: They came in countless numbers, riding fierce beasts and bringing slaughter.
zh_cn: 他们数量多得数不清，骑着凶猛的野兽，四处为虐。

source: Everyone said they would never breach the city walls but everyone was wrong.
zh_cn: 所有人都是他们进不了城墙但是所有人都错了。

source: Soon all the boy could hear was screaming and dying throes.
zh_cn: 不久男孩儿听到的就全是尖叫声和死人的痛呼。

source: "Should I kill them for you?" he asked his mother.
zh_cn: “我应该为你杀了他们么？”他问自己的母亲。

source: She ran her hands through his hair.
zh_cn: 她的手指穿过他的头发。

source: "No, Dear Sunshine.
zh_cn: “不，亲亲阳光。

source: Let them come."
zh_cn: 让他们来。”

source: Let them slaughter, she meant.
zh_cn: 让他们屠杀，她想这样。

source: He understood.
zh_cn: 他明白。

source: The dragon did too.
zh_cn: 龙也明白。

source: The barbarian king killed the boy's father in the throne room.
zh_cn: 野蛮人的头领在皇宫里杀死了男孩儿的爸爸。

source: Afterwards he summoned Dear Sunshine to come before him.
zh_cn: 之后，他将亲亲阳光唤到跟前。

source: "They tell me you have a dragon behind your eyes," the barbarian said.
zh_cn: “他们告诉我你眼里有一只龙，”野蛮人说。

source: Dear Sunshine did not reply.
zh_cn: 亲亲阳光没有回答。

source: "They say you killed your siblings."
zh_cn: “他们说你杀了同族人。

source: Still, Dear Sunshine said nothing.
zh_cn: 一动不动，亲亲阳光一言不发。

source: "But, you see, dragons don't slit throats. People do."
zh_cn: “可你看，龙不割喉咙，但是人却这么干。”

source: "Yes," the boy said.
zh_cn: “是，”男孩儿回答。

source: "Was it you that left the city gates open?" the barbarian asked.
zh_cn: “是你让城门大开的么？”野蛮人问。

source: "No," the boy said.
zh_cn: “不是我，”男孩儿说。

source: "Your mother is a bit of a monster, I think," the barbarian said.
zh_cn: “你母亲是个怪物，我想。”野蛮人说。

source: "She is my mother," the boy said simply.
zh_cn: “她是我母亲，”男孩儿只是说。

source: The barbarian took the former queen as a whore and the whole kingdom knew.
zh_cn: 野蛮人把前任女王当做妓女，全国上下都知道。

source: "He thinks I'll bear him a dragon son," she told Dear Sunshine.
zh_cn: “他想让我给他生了个龙儿子，”她对亲亲阳光说。

source: "He's just as stupid as your father."
zh_cn: “他和你父亲一样蠢。”

source: "Shall I kill him for you?" he asked.
zh_cn: “我该为你杀了他么？”他问。

source: "No."
zh_cn: “不。”

source: "Why not?"
zh_cn: “为什么不？”

source: "The assassins have stopped, haven't they?
zh_cn: “暗杀已经停止了，是吧？

source: Let him be while he leaves you be."
zh_cn: 他让你活着，你就让他活着。“

source: When he turned twenty his mother killed the barbarian king.
zh_cn: 他二十岁时，他母亲杀死了野蛮人王。

source: She stabbed him through the heart during their lovemaking.
zh_cn: 她在她们做爱的时候刺穿了他的心脏。

source: Afterwards she declared herself Empress- "Not Queen"- and slaughtered anyone who dared protest.
zh_cn: 之后，她宣城自己为女皇----“而非皇后”----任何胆敢反对的人都格杀勿论。

source: She met little resistance because everyone feared her dragon son.
zh_cn: 她几乎没有遇到任何反抗，因为所有人都怕她的龙儿子。

source: By then, Dear Sunshine realized his mother did not need him to kill people for her.
zh_cn: 知道那时，亲亲阳光才意识到他母亲根本不需要他为她杀人。

source: "What would you like me to do?" he asked her one day.
zh_cn: “你想让我为你做点什么？”终有一天，他问她。

source: "Are you my son or a dragon?" she asked.
zh_cn: “你是我的儿子还是龙？”她问。

source: He thought hard before answering. "Both."
zh_cn: 他认真地思考，之后回答：“二者都是。”

source: She stroked his cheek.
zh_cn: 她轻抚他的面颊。

source: "Then that is enough."
zh_cn: “那，这就足够了。”
